lupyuen/bl602_expander/bl602_expander.c
/****************************************************************************
 * drivers/ioexpander/bl602_expander.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/kmalloc.h>
#include <nuttx/semaphore.h>
#include <nuttx/ioexpander/ioexpander.h>
#include <nuttx/ioexpander/bl602_expander.h>
#include <nuttx/ioexpander/gpio.h>
#include <arch/board/board.h>
#include "../arch/risc-v/src/common/riscv_internal.h"
#include "../arch/risc-v/src/bl602/bl602_gpio.h"

#if defined(CONFIG_IOEXPANDER_BL602_EXPANDER)

#ifndef CONFIG_IOEXPANDER_INT_ENABLE
#error GPIO Interrupts must be handled by BL602 GPIO Expander
#endif /* !CONFIG_IOEXPANDER_INT_ENABLE */

#ifndef CONFIG_GPIO_LOWER_HALF
#error GPIO Lower Half is required by BL602 GPIO Expander
#endif /* !CONFIG_GPIO_LOWER_HALF */

#ifdef CONFIG_BL602_EXPANDER_MULTIPLE
#error Multiple BL602 GPIO Expanders are not supported
#endif /* CONFIG_BL602_EXPANDER_MULTIPLE */

#ifdef CONFIG_IOEXPANDER_MULTIPIN
#error Multipin BL602 GPIO Expander is not supported
#endif /* CONFIG_IOEXPANDER_MULTIPIN */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

#ifdef CONFIG_IOEXPANDER_INT_ENABLE
/* Callback for a registered pin interrupt */

struct bl602_expander_callback_s
{
  ioe_pinset_t pinset;   /* Set of pins that will trigger the interrupt callback */
  ioe_callback_t cbfunc; /* Callback function */
  FAR void* cbarg;       /* Callback argument */
};
#endif

/* I/O Expander Driver State */

struct bl602_expander_dev_s
{
  struct ioexpander_dev_s dev;  /* Nested structure to allow casting as public gpio expander */
#ifdef CONFIG_BL602_EXPANDER_MULTIPLE
  FAR struct bl602_expander_dev_s *flink; /* Supports a singly linked list of drivers */
#endif
  sem_t exclsem;                /* Mutual exclusion */

#ifdef CONFIG_IOEXPANDER_INT_ENABLE
  struct work_s work;           /* Supports the interrupt handling "bottom half" */

  /* Saved callback information for each I/O expander client */

  struct bl602_expander_callback_s cb[CONFIG_IOEXPANDER_NPINS];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bl602_expander_lock(FAR struct bl602_expander_dev_s *priv);

static int bl602_expander_direction(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                          int dir);
static int bl602_expander_option(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                       int opt, void *val);
static int bl602_expander_writepin(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                         bool value);
static int bl602_expander_readpin(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                        FAR bool *value);
static int bl602_expander_readbuf(FAR struct ioexpander_dev_s *dev, uint8_t pin,
                        FAR bool *value);
#ifdef CONFIG_IOEXPANDER_MULTIPIN
static int bl602_expander_multiwritepin(FAR struct ioexpander_dev_s *dev,
                              FAR uint8_t *pins, FAR bool *values,
                              int count);
static int bl602_expander_multireadpin(FAR struct ioexpander_dev_s *dev,
                             FAR uint8_t *pins, FAR bool *values, int count);
static int bl602_expander_multireadbuf(FAR struct ioexpander_dev_s *dev,
                             FAR uint8_t *pins, FAR bool *values, int count);
#endif
#ifdef CONFIG_IOEXPANDER_INT_ENABLE
static FAR void *bl602_expander_attach(FAR struct ioexpander_dev_s *dev,
                       ioe_pinset_t pinset,
                       ioe_callback_t callback, FAR void *arg);
static int bl602_expander_detach(FAR struct ioexpander_dev_s *dev,
                       FAR void *handle);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifndef CONFIG_BL602_EXPANDER_MULTIPLE
/* If only a single device is supported, then the driver state structure may
 * as well be pre-allocated.
 */

static struct bl602_expander_dev_s g_bl602_expander_dev;
#endif

/* I/O Expander Operations */

static const struct ioexpander_ops_s g_bl602_expander_ops =
{
  bl602_expander_direction,
  bl602_expander_option,
  bl602_expander_writepin,
  bl602_expander_readpin,
  bl602_expander_readbuf
#ifdef CONFIG_IOEXPANDER_MULTIPIN
  , bl602_expander_multiwritepin
  , bl602_expander_multireadpin
  , bl602_expander_multireadbuf
#endif
#ifdef CONFIG_IOEXPANDER_INT_ENABLE
  , bl602_expander_attach
  , bl602_expander_detach
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bl602_expander_intmask
 *
 * Description:
 *   Set Interrupt Mask for a GPIO Pin. Based on
 *   https://github.com/apache/incubator-nuttx/blob/master/boards/risc-v/bl602/bl602evb/src/bl602_gpio.c#L143-L169
 *
 ****************************************************************************/

static void bl602_expander_intmask(uint8_t gpio_pin, int intmask)
{
  uint32_t tmp_val;

  if (gpio_pin < GPIO_PIN28)
    {
      tmp_val = getreg32(BL602_GPIO_INT_MASK1);
      if (intmask == 1)
        {
          tmp_val |= (1 << gpio_pin);
        }
      else
        {
          tmp_val &= ~(1 << gpio_pin);
        }

      putreg32(tmp_val, BL602_GPIO_INT_MASK1);
    }
  else
    {
      gpioerr("Invalid pin %d\n", gpio_pin);
      DEBUGPANIC();
    }
}

/****************************************************************************
 * Name: bl602_expander_set_intmod
 *
 * Description:
 *   Set GPIO Interrupt Mode. Based on
 *   https://github.com/apache/incubator-nuttx/blob/master/boards/risc-v/bl602/bl602evb/src/bl602_gpio.c#L171-L212
 *
 ****************************************************************************/

static void bl602_expander_set_intmod(uint8_t gpio_pin,
              uint8_t int_ctlmod, uint8_t int_trgmod)
{
  gpioinfo("gpio_pin=%d, int_ctlmod=%d, int_trgmod=%d\n", gpio_pin, int_ctlmod, int_trgmod);
  uint32_t tmp_val;

